Tinkerbug-Robotics/TinkerRocket/tinkerrocket-idf/projects/flight_computer/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"

# No power management — runs at full speed
CONFIG_PM_ENABLE=n

# No BLE on FlightComputer
CONFIG_BT_ENABLED=n

# Flash — 8 MB, which is the SMALLEST boot NOR in the fleet, not the typical
# one. The two ways of getting this wrong are not symmetric:
#
#   too small   benign. Boots, logs "Detected size(16384k) larger than the size
#               in the binary image header(8192k)", leaves the top of the part
#               unreachable.
#   too large   FATAL, and in the bootloader, so no firmware ever runs to say so:
#                 E spi_flash: Detected size(8192k) smaller than the size in the
#                              binary image header(16384k). Probe failed.
#                 E esp_core_dump_flash: Core dump flash config is corrupted!
#               A continuous boot loop on a board that is perfectly good.
#
# The fleet is genuinely mixed and the split has a date. U13/U16 were
# W25Q64JVXGIQ (8 MB) until the V9 fab close-out on 2026-08-09 and
# W25Q128JVSIQ / GD25Q128ESIG (16 MB) after it — see hardware/rocket-computer/
# bom.csv across 199ecec -> 8f87aa0. So V7/V8 are 8 MB and V9/V10 are 16 MB.
#
# MEASURED on the V7 board 2026-08-24 with `esptool flash-id`, both MCUs:
#   FC (ESP32-P4, MAC 30:ed:a0:e3:64:9c)  manufacturer ef, device 7017 -> 8 MB
#   OC (ESP32-S3, MAC e0:72:a1:ca:e1:50)  manufacturer ef, device 7017 -> 8 MB
#
# V9/V10 raises this to 16 MB in sdkconfig.defaults.v9, applied by the project
# CMakeLists off TR_BOARD_V9 — a per-board hardware fact belongs in the
# per-board overlay, next to PSRAM, not in a fleet-wide constant. 8 MB stays
# here as the BASE because it is the value that boots on every rocket computer
# ever built, including the V8 bench units whose artwork was never committed
# and whose parts nobody has read. It costs nothing: partitions.csv ends at
# 0x610000 (6.06 MB), well inside 8 MB on either part.
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# OTA rollback: a relayed image boots PENDING_VERIFY and auto-reverts to ota_0
# unless the FC marks itself valid after resuming its I2S telemetry stream to
# the OC post-reboot. See docs/plans/08-ota-firmware-update.md §4 / §7.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# Serial
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# --- ESP32-P4 / IDF version tuning (#88) ---------------------------------
# ESP32-P4 silicon: our boards are v1.x. IDF 5.5+ raises the default min chip
# rev to v3.x, which refuses to boot on v1.x. Accept the legacy series.
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y

# Brownout: IDF 5.5 defaults the P4 detector to 2.6V (LVL_SEL_7), which trips
# during servo-PWM init on this board. Pin to the most-lenient level (2.42V).
#
# TARGET-SPECIFIC. The selector numbering is reversed between the P4 and the
# S3, so this line does NOT mean "most lenient" on every flight_computer
# build: P4 SEL_5/6/7 = 2.42/2.52/2.60 V, S3 SEL_5/6/7 = 2.67/2.56/2.44 V.
# The mini's FC is an S3 and overrides this in sdkconfig.defaults.m1 — see
# there. Anything added below that is a voltage-, pad- or die-specific
# constant needs the same check before it is assumed to be portable.
CONFIG_ESP_BROWNOUT_DET_LVL_SEL_5=y

# Main task stack: the 5.5 default (3584 B) overflows FC's synchronous sensor
# init when the Arduino loop stack isn't present. Restore the prior 16 KB.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384

# --- Deliberately-unused silicon on the FC (#851) -------------------------
# Recorded as DECISIONS, not omissions.  The OC spent a month discovering its
# PSRAM only after the MRAM was deleted from under it; the point of writing
# these down is that the next person reads "off because we decided" rather
# than "off because nobody looked".
#
# 1) U17 is an ESP32-P4NRW32 — 32 MB of IN-PACKAGE PSRAM — and there is no
#    CONFIG_SPIRAM here on purpose.  The FC has no identified need: its logs
#    stream to the OC over I2S rather than buffering locally, which is what
#    the OC's PSRAM exists for (#842, the MRAM's replacement).  Enabling it
#    is NOT free on this board — PSRAM access goes through the cache and can
#    perturb the timing determinism of a 3840 Hz IMU path and a ~976 Hz
#    control loop, which is measured and currently clean.  Revisit only when
#    something concrete needs the space, and re-measure loop timing and the
#    gap counters (#910) if it is ever turned on.
#
# 2) Y3, the FC's 32.768 kHz crystal, is fitted but unused: no
#    CONFIG_RTC_CLK_SRC_EXT_CRYS, so the RTC runs on the internal RC.  That
#    is fine here — the crystal matters for light-sleep and accurate RTC
#    timekeeping, and the FC does neither.  It is awake for the whole flight,
#    and the low-power path belongs to the OC (#519: EXT_CRYS + BT LP clock
#    + XT-WDT).  If FC light-sleep is ever wanted, this is the first switch.
#
# 3) Boot NOR: V9 fits a W25Q128JVSIQ (16 MB) and this file declares 8 MB —
#    CONFIG_ESPTOOLPY_FLASHSIZE_8MB above.  That is correct and deliberate,
#    not an oversight, and it is ENFORCED: tools/check_flash_declarations.py
#    requires the declared size to be the smallest standard size that fits the
#    partition table, and partitions.csv tops out near 6.32 MB.  Declaring
#    16 MB would fail that guard, and on any board that turns out to carry an
#    8 MB part it boot-loops inside the bootloader before firmware runs — the
#    #883 regression, fixed 2026-08-24 by forking the declaration per board
#    revision.  Under-declaring simply leaves the upper half unused, which is
#    the safe direction.
#
#    Raising the partition table to use the other 8 MB is the change that
#    would justify declaring 16 MB, and it is not worth forking the layout per
#    hardware generation until something needs the space (V8 bench boards may
#    carry 8 MB parts).
#
#    (An earlier version of this note claimed the file "now declares 16 MB".
#    It never did — corrected 2026-09-10.  The whole point of this block is
#    that the next person can trust what it says.)
